app/controllers/friends_controller.rb

  def show
    @friend = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @friend = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @friend = Friend.new(params[:friend])

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("created_at", "email", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 26 Aug 2012 20:00:01 UTC +00:00], ["email", "dkeefe75@gmail.com"], ["name", "Dennis Keefe"], ["phone", "850-541-6534"], ["updated_at", Sun, 26 Aug 2012 20:00:01 UTC +00:00]]

  def update
    @friend = Friend.find(params[:id])

    respond_to do |format|
      if @friend.update_attributes(params[:friend])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "friends" SET "name" = 'Beverly Nelson', "email" = 'beverly@beverlynelson.net', "phone" = '', "updated_at" = '2012-08-26 20:08:25.922871' WHERE "friends"."id" = 1